blog-posts/2007-10-05-remembering-to-org-and-planner.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Remembering to Org and Planner</title>
<!-- 2014-04-30 Wed 17:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Remembering to Org and Planner</h1>
<p>
October 5th, 2007 -
<a href="http://sachachua.com/blog/p/4384"><a href="http://sachachua.com/blog/p/4384">http://sachachua.com/blog/p/4384</a></a>
</p>

<p>
Most of my notes are in Emacs Planner. Handy commands like M-x
 remember help me quickly take notes and write down ideas, saving the
 text to my blog.
</p>

<p>
While reading the manual for Org, another PIM for Emacs (yes, another
 one!), I decided to give it a try. Org uses Remember, the same quick
 note-taking module that Planner does. I wanted to set up Emacs so that
 I could remember a note and have it go either to my Planner-based blog
 or to my notes file.
</p>

<p>
M-x remember is a two-step procedure. First, Remember sets up the
 buffer and inserts the annotation. After you write the note and press
 C-c C-c, Remember passes the note's contents to a handler function.
 Because Planner and Org have incompatible annotation functions and
 destinations, I needed to override both.
</p>

<p>
Here's how I did that:
</p>

<pre class="example">
(defun sacha/remember-to-org ()
  (interactive)
  (let ((org-directory "~/path/to/my/orgfiles/")
        (org-default-notes-file "~/.notes")
        (remember-annotation-functions '(org-remember-annotation))
        (remember-mode-hook (cons 'org-remember-apply-template
                                  remember-mode-hook)))
    (remember)
    (set (make-variable-buffer-local 'remember-handler-functions)
         '(org-remember-handler))))
(global-unset-key [f9 ?o])
(global-set-key [f9 ?o ?r] 'sacha/remember-to-org)
(global-set-key [f9 ?r ?o] 'sacha/remember-to-org)
</pre>

<p>
I've set up Remember to work with Planner by default:
</p>

<pre class="example">
(setq remember-handler-functions '(remember-planner-append))
(setq remember-annotation-functions planner-annotation-functions)
(global-set-key [f9 ?r ?p] 'remember)
(global-set-key [f9 ?p ?r] 'remember)
(global-set-key (kbd " r SPC") 'remember)
</pre>

<p>
I've added plenty of keyboard shortcuts to see which ones feel the most
natural.
</p>

<p>
I'm looking forward to playing around with this and seeing what works!
</p>

<p>
Random Emacs symbol: tty-color-define &#x2013; Function: Specify a tty color
by its NAME, terminal INDEX and RGB values.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
